Repository: goegol/dsmr-reader
Catalog: docs/_locale/*/LC_MESSAGES/how-to/development.po
Languages: nl

source: Developing: Localhost
nl: Ontwikkelen: Lokaal

source: Contents
nl: Inhoudsopgave

source: Setting up a development environment using Docker
nl: Ontwikkelomgeving inrichten via Docker

source: I'm using JetBrain's PyCharm IDE for local development, which has builtin support for Git and Docker. Therefor some steps or information below may or may not match your own development stack.
nl: Ik gebruik JetBrain's PyCharm IDE om lokaal te ontwikkelen. Deze heeft ingebouwde ondersteuning voor Git en Docker, dus het kan zijn dat informatie of stappen hieronder wat afwijken van je eigen situatie.

source: Install Docker on your system. E.g. Ubuntu: https://docs.docker.com/engine/install/ubuntu/ and consider rootless: https://docs.docker.com/engine/security/rootless/
nl: Installeer Docker op je systeem. Bijvoorbeeld voor Ubuntu: https://docs.docker.com/engine/install/ubuntu/ en overweeg rootless: https://docs.docker.com/engine/security/rootless/

source: Clone DSMR-reader repository from GitHub::
nl: Kloon DSMR-reader repository van GitHub::

source: Symlink Docker files required (or just copy them)::
nl: Symlink benodigde Docker-bestanden (of kopiÃ«er ze)::

source: Copy Django settings template::
nl: Kopieer Django settings-template::

source: Open the settings template ``dsmrreader/settings.py`` you've copied and **replace**::
nl: Open de settings-template ``dsmrreader/settings.py`` die je net gekopieerd hebt en vervang::

source: With::
nl: Met::

source: Try running Docker (compose)::
nl: Probeer Docker (compose)::

source: Containers built? See if this command works::
nl: Zijn de containers gebouwd? Probeer of dit werkt::

source: Now check whether tests run well in SQLite::
nl: Probeer nu of de tests goed draaien met SQLite::

source: Other DB engines can be tested as well, but the CI will take care of it anyway. The SQLite engine matches 99%% of the features DSMR-reader requires and it also runs in-memory, speeding up tests.
nl: Andere DB-engines kunnen ook getest worden, maar dit doet de CI ook al. De SQLite-engine ondersteunt overigens 99%% van de features die DMSR-reader nodig heeft. Daarnaast draait deze ook in-memory, waardoor de tests weer sneller draaien.

source: When using PyCharm, you can add a new Interpreter using Docker Compose. Just select ``dsmr-app`` and set ``/opt/venv/bin/python`` as interpreter path. It should now map all dependencies used/installed in the container.
nl: Wanneer je PyCharm gebruikt kun je een nieuwe Interpreter toevoegen die Docker Compose gebruikt. Selecteer ``dsmr-app`` en stel ``/opt/venv/bin/python`` in als interpreter path. Nu zouden alle gebruikte dependencies goed gemapt moeten worden vanuit de container.

source: Initial data to develop with
nl: Initiele gegevens om mee te ontwikkelen

source: To be honest, the best initial/fixture data is simply a backup of your own system in production.
nl: De beste gegevens om mee te ontwikkelen zijn eerlijk gezegd simpelweg gegevens uit je eigen productieomgeving.

source: Please note that you should not run any (backend) processes in your DSMR-reader development environment, **until you've unlinked all external services**.
nl: Voorkom dat je (achtergrond)processen draait in je lokale DSMR-reader ontwikkelomgeving, **totdat je alle externe diensten hebt ontkoppeld**.

source: After importing the backup of your production system, simply run::
nl: Voer simpelweg het volgende uit, na het importeren van een backup uit je eigen productieomgeving::

source: This will remove all API keys and other links to externals systems, as well as reset the admin user credentials to ``admin / admin`` (user / password).
nl: Dit verwijdert alle API-keys en andere koppelingen naar externe systemen. Tevens wordt de admin-gebruiker gereset naar ``admin / admin`` (gebruiker / wachtwoord).

source: Just import it as you should on your RaspberryPi. Copy a database backup to ``/var/lib/postgresql/`` on your PC and import it::
nl: Importeer deze zoals je dat ook zou doen op je RaspberryPi. Kopieer een database-backup naar ``/var/lib/postgresql`` op je PC en importeer deze met::

source: Fake datalogger
nl: Nep datalogger

source: There is a builtin command that can somewhat fake a datalogger::
nl: Er is een ingebouwd command voor een soort van datalogger die nepdata genereert::

source: It will generate random data every second in a certain pattern and should be fine for basic testing.
nl: Deze genereert elke seconde willekeurige gegevens in een bepaald patroon en is vaak meer dan afdoende voor simpele testdoeleinden.

source: Please note that it only inserts unprocessed readings, so you'll still have to run the following command to have the readings processed::
nl: Hiermee worden alleen onverwerkte metingen aangemaakt. Je zult ze nog steeds moeten verwerken door het volgende uit te voeren::

source: Running DSMR-reader locally
nl: DSMR-reader lokaal draaien

source: When running it with the default Docker compose config, the ``dsmr-app`` `Django Development Server application <https://docs.djangoproject.com/en/3.2/intro/tutorial01/#the-development-server>`_ will be accessible at: ``http://localhost:8000/``.
nl: Wanneer je de standaard Docker compose configuratie gebruikt, is de ``dsmr-app`` `Django Development Server applicatie <https://docs.djangoproject.com/en/3.2/intro/tutorial01/#the-development-server>`_ toegankelijk op: ``http://localhost:8000/``.

source: Any Python code changes you make will cause the Django Development Server to reload itself automatically.
nl: Wijzigingen aan Python-bestanden zorgen ervoor dat de Django Development Server zichzelf automatisch herlaadt.

source: Tests and coverage
nl: Tests en dekking

source: DSMR-reader's test coverage should remain as high as possible, however this does not guarantee the quality of tests, so find a sweet spot for coverage whenever possible.
nl: DSMR-reader's testdekking zou zo hoog mogelijk moeten blijven, alhoewel dat niet perse wat zegt over de kwaliteit van de tests. Zoek hier een middenweg in.

source: The easiest way to run tests is to use the SQLite (in-memory) tests::
nl: De makkelijkste manier om tests te draaien is via de SQLite (in-memory) tests::

source: To test a single app within DSMR-reader, just append it::
nl: Om een enkele app binnen DSMR-reader te testen, geef je deze simpelweg als extra argument op::

source: The test coverage should be visible in the terminal after running tests. There are detailed HTML pages available as well, after each test run, in ``coverage_report/html/index.html``. Just open it with your browser to view the test coverage of each file and line.
nl: De test dekking zou na het draaien van tests zichtbaar moeten zijn in de terminal. Er zijn tevens gedetaileerde HTML-pagina's beschikbaar in ``coverage_report/html/index.html``, na het draaien van tests. Je kunt deze openen met je browser om de test dekking in detail te zien per bestand en per regel code.

source: A side effect of running tests is that it may also regenerate .PO files from the ``docs/`` folder. If you did not make any changes there, your should just ignore those changed files and revert them.
nl: Een mogelijk bijeffect van het draaien van tests is dat hiermee ook .PO-bestanden in de ``docs/`` map bijgewerkt worden. Als je daar geen wijzigingen in hebt gedaan, kun je die door de tests gewijzigde bestanden negeren.

source: Translations
nl: Vertalingen

source: You can find the translations (.PO files) for the main application in ``dsmrreader/locales/``. To regenerate them, just execute the ``docker exec -it dsmr-app poetry run ./tools/check-translations.sh`` script.
nl: Je kunt de vertalingen (.PO-bestanden) voor de hoofdapplicatie vinden in ``dsmrreader/locales/``. Om ze te hergenereren voer het ``docker exec -it dsmr-app poetry run ./tools/check-translations.sh`` script uit, zodat een van de tests de vertalingen opnieuw checkt.

source: Editing documentation
nl: Documentatie bijwerken

source: The documentation is part of the repository and can be generated (automatically) with Sphinx.
nl: De documentatie is onderdeel van het project en kan (automatisch) gegenereerd worden via Sphinx.

source: By default the Docker compose file should create and run a docs container for each language supported.
nl: Standaard zou de Docker compose file een container moeten maken voor documentatie, per ondersteunde taal.

source: English::
nl: Engelstalig::

source: Dutch::
nl: Nederlandstalig::

source: Any changes you make will be reflected instantly in the browser, as Sphinx continuously checks for changed files.
nl: Wijzigingen die je doorvoert in Pworden direct automatisch bijgewerkt en getoond in je browser, waar Sphinx voor zorgt.

source: Translating documentation
nl: Documentatie vertalen

source: Translations are done using gettext and .PO files. Regenerate the .PO files with::
nl: Vertalingen verlopen via .PO-bestanden met gettext. Hergenereer de .PO-bestanden met::

source: The .PO files in ``docs/locale`` should be regenerated now. You can use the open-source tool ``poedit`` to view and translate the files.
nl: De .PO-bestanden in ``docs/_locale`` zouden nu opnieuw gegenereerd moeten worden. Je kunt het open-source programma ``poedit`` gebruiken om de bestanden te bekijken en te vertalen.
